---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintX
source: html/4498301e-becb-7cf4-e6e0-16ba2ba4593a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintX Property

"X Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryRestraintX { get; }
```